# https://github.com/encrypted-def/basic-algo-lecture/blob/master/workbook/0x09.md
# 연습 문제	1926	그림	정답 코드
# 연습 문제	2178	미로 탐색	정답 코드
# 연습 문제	7576	토마토	정답 코드
# 연습 문제	4179	불!	정답 코드
# 연습 문제	1697	숨바꼭질	정답 코드
# 기본 문제✔	1012	유기농 배추	정답 코드
# 기본 문제✔	10026	적록색약	정답 코드
# 기본 문제✔	7569	토마토	정답 코드
# 기본 문제✔	7562	나이트의 이동	정답 코드
# 기본 문제✔	5427	불	정답 코드
# 기본 문제	2583	영역 구하기	정답 코드
# 기본 문제	2667	단지번호붙이기	정답 코드
# 기본 문제	5014	스타트링크	정답 코드
# 기본 문제	2468	안전 영역	정답 코드
# 기본 문제	6593	상범 빌딩	정답 코드
# 응용 문제✔	2206	벽 부수고 이동하기	정답 코드
# 응용 문제✔	9466	텀 프로젝트	정답 코드
# 응용 문제✔	2573	빙산	정답 코드
# 응용 문제✔	2146	다리 만들기	정답 코드, 별해 1
# 응용 문제✔	13549	숨바꼭질 3	정답 코드, 별해 1
# 응용 문제✔	1600	말이 되고픈 원숭이	정답 코드
# 응용 문제	13913	숨바꼭질 4	정답 코드
# 응용 문제	14442	벽 부수고 이동하기 2	정답 코드
# 응용 문제	16933	벽 부수고 이동하기 3	정답 코드
# 응용 문제	16920	확장 게임	정답 코드
# 응용 문제	11967	불켜기	정답 코드
# 응용 문제	17071	숨바꼭질 5	정답 코드
# 응용 문제	9328	열쇠	정답 코드
# 응용 문제	3197	백조의 호수	정답 코드
# 응용 문제	20304	비밀번호 제작
