# https://github.com/encrypted-def/basic-algo-lecture/blob/master/workbook/0x0C.md
# 연습 문제	15649	N과 M (1)	정답 코드
# 연습 문제	9663	N-Queen	정답 코드
# 연습 문제	1182	부분수열의 합	정답 코드
# 기본 문제✔	15650	N과 M (2)	정답 코드, 별해 1
# 기본 문제✔	15651	N과 M (3)	정답 코드
# 기본 문제✔	15652	N과 M (4)	정답 코드
# 기본 문제✔	15654	N과 M (5)	정답 코드
# 기본 문제✔	15655	N과 M (6)	정답 코드
# 기본 문제✔	15656	N과 M (7)	정답 코드
# 기본 문제✔	15657	N과 M (8)	정답 코드
# 기본 문제✔	15663	N과 M (9)	정답 코드
# 기본 문제✔	15664	N과 M (10)	정답 코드
# 기본 문제✔	15665	N과 M (11)	정답 코드
# 기본 문제✔	15666	N과 M (12)	정답 코드
# 기본 문제✔	6603	로또	정답 코드, 별해 1
# 기본 문제	1759	암호 만들기	정답 코드, 별해 1
# 응용 문제✔	1941	소문난 칠공주	정답 코드
# 응용 문제✔	16987	계란으로 계란치기	정답 코드
# 응용 문제	18809	Gaaaaaaaaaarden	정답 코드
# 응용 문제	1799	비숍	정답 코드
