# https://github.com/encrypted-def/basic-algo-lecture/blob/master/workbook/0x0D.md
# 연습 문제	15683	감시	정답 코드
# 연습 문제	18808	스티커 붙이기	정답 코드
# 연습 문제	12100	2048 (Easy)	정답 코드
# 연습 문제	15686	치킨 배달	정답 코드
# 기본 문제✔	11559	Puyo Puyo	정답 코드
# 기본 문제✔	14891	톱니바퀴	정답 코드
# 기본 문제✔	14499	주사위 굴리기	정답 코드
# 기본 문제✔	13335	트럭	정답 코드
# 기본 문제✔	16985	Maaaaaaaaaze	정답 코드
# 기본 문제✔	14503	로봇 청소기	정답 코드
# 기본 문제✔	3190	뱀	정답 코드
# 기본 문제✔	14500	테트로미노	정답 코드, 별해 1
# 기본 문제✔	13460	구슬 탈출 2	정답 코드
# 기본 문제✔	14502	연구소	정답 코드, 별해 1
# 기본 문제✔	14888	연산자 끼워넣기	정답 코드, 별해 1
# 기본 문제✔	14889	스타트와 링크	정답 코드
# 기본 문제✔	14890	경사로	정답 코드
# 기본 문제✔	15684	사다리 조작	정답 코드
# 기본 문제✔	15685	드래곤 커브	정답 코드
# 기본 문제	17281	⚾	정답 코드, 별해 1
# 기본 문제	5373	큐빙	정답 코드
# 기본 문제	16234	인구 이동	정답 코드
# 기본 문제	16235	나무 재테크	정답 코드
# 기본 문제	16236	아기 상어	정답 코드
# 기본 문제	17140	이차원 배열과 연산	정답 코드
# 기본 문제	17141	연구소 2	정답 코드
# 기본 문제	17142	연구소 3	정답 코드
# 기본 문제	17143	낚시왕	-
# 기본 문제	17144	미세먼지 안녕!	-
# 기본 문제	4991	로봇 청소기	-
# 기본 문제	16986	인싸들의 가위바위보	정답 코드
# 기본 문제	17779	게리맨더링 2	-
# 기본 문제	17837	새로운 게임 2	-
# 기본 문제	17822	원판 돌리기	-
# 기본 문제	17825	주사위 윷놀이	정답 코드
# 기본 문제	19235	모노미노도미노	정답 코드
# 기본 문제	20061	모노미노도미노 2	-
# 기본 문제	19236	청소년 상어	-
# 기본 문제	19237	어른 상어	-
# 기본 문제	19238	스타트 택시	-
# 기본 문제	20055	컨베이어 벨트 위의 로봇	-
# 기본 문제	20056	마법사 상어와 파이어볼	-
# 기본 문제	20057	마법사 상어와 토네이도	-
# 기본 문제	20058	마법사 상어와 파이어스톰	-
# 기본 문제	16637	괄호 추가하기	-
# 기본 문제	17070	파이프 옮기기 1	정답 코드, 별해 1
# 기본 문제	17135	캐슬 디펜스	정답 코드
# 기본 문제	17136	색종이 붙이기	-
# 기본 문제	17406	배열 돌리기 4	-
# 기본 문제	17471	게리맨더링	-
# 기본 문제	17472	다리 만들기 2	-
# 기본 문제	15898	피아의 아틀리에 신비한 대회의 연금술사	-
# 기본 문제	21608	상어 초등학교	-
# 기본 문제	21609	상어 중학교	-
# 기본 문제	21610	마법사 상어와 비바라기	-
# 기본 문제	21611	마법사 상어와 블리자드	-
# 기본 문제	23288	주사위 굴리기 2	-
# 기본 문제	23289	온풍기 안녕!	-
# 기본 문제	23290	마법사 상어와 복제	-
# 기본 문제	23291	어항 정리